<template>
  <div class='row'>
    <div class='table1'>
      <ContentTable :content-table='contentTable' />
    </div>
    <div class='article'>
      <h2>1  内容提要</h2>
      <p>
        当我们说 Web3.0，我们通常倾向于将其视为互联网发展过程中的特定阶段，特定关联于去 中心化、区块链、抗审查、数据确权、身份验证、元宇宙等，但也仅此而已。时至今日，
        所 有关于 Web3.0 的应用，依然仅限于在 OpenSea 上发布 NFT 出售，无论该 NFT 是一张图片， 还是某虚拟世界的一个地块，其本质未变。马斯克抨击 Web3.0 到目前为止只是骗局，
        在当 前场景下适用于大多数人。但科技的发展总是从今天我们不能理解的地方开始，而这样的发 展通常在明天会变成我们生活的日常，于 Web3.0 而言，其依然处于初生阶段，
        理性上我们 不能预测 Web3.0 为社会带来的实际价值与变革，在主权社会中甚至可能遭遇极大的困难与 障碍，然而 Web3.0 中带来的对于社会个体的价值提升，
        是无论去中心化还是中心化的社会体制下向更高层次的文明演进。 本文档用于描述 Web3.0 Eye 的起因，以及 Web3.0 Eye 试图在 Web3.0 场景下解决的问题。
      </p>
      <p>
        本文档将致力于将特定于 Web3.0 某场景下的细微问题阐述清楚，并尝试构建该问题的解决 方案。我们承认，Web3.0 Eye 无论对于传统的互联网体系，还是新的 Web3.0 场景，
        都不能 称之为一个性感的故事；但我们亦相信，划时代的概念从提出到渗透主流社会的方方面面， 需要经历漫长时间，那些最终能够对社会产生巨大影响的概念，
        在发展过程中亦需先踏实基 础设施，而后经历漫长的场景迭代，而后规模应用。本文档的阅读对象主要包含参与构建 Web3.0 Eye 体系的工程师、架构师、产品经理、项目经理，
        以及 Web3.0 Eye 之外致力于构 建 Web3.0 基础设施的人。
      </p>
      <h2>2 Web3.0 Eye 是什么</h2>
      <p>如果模仿《百年孤独》写一段回忆录，那么 2021 在科技从业者的回忆录中，大概会以以下 方式开头：</p>
      <p class='caption'>
        多年以后，当我站在飞往猎户座的飞行器控制中心，准会想起从 OpenSea 上买了一只猴子的遥远的下午。 当时，元宇宙是个圈钱的概念，几个场景，
        几张 3D 建模图片，人们疯狂追捧，寄望遥远的新世界大门。那 个年份被人们称为“元宇宙元年”。
      </p>
      <p>
        在该元年，一切和元宇宙、NFT 相关的事物都被资本追捧，旧有体系都试图给自己披上新鲜 的外衣，最大的 NFT 交易所 OpenSea 估值一路狂飙，NFT 作品售价高企，
        一片繁荣。但潮 水褪去，暴富者月球漫步，裸泳者依然裸泳，留存在我脑子中最深刻的概念，不是跑鞋赚了 多少钱，亦不是 Loot 的随机词库如何组成，
        反而是当我在 OpenSea 购买了 NFT 作品，我怎 么知道我购买的作品最早来自于何方？在 Web 的历史上是否曾经存在过？
      </p>
      <p>
        Web3.0 Eye 的构思，试图解决的是最简单的问题：让购买 NFT 和发行 NFT 的人可以按图索 骥。所谓骥，即为与图相关的 Web2.0 和 Web3.0 的内容及其历史线索。
        在 Web3.0 Eye 的构 思中，使用者只需要提供一张图，该图可能来自于其购买的 NFT，也可能是使用者创作的 NFT 作品，Web3.0 Eye 将整合与该图相关的 Web2.0 和 Web3.0 关联内容，
        按照时间线返回 给使用者。对于购买者，其价值在于为购买者提供购买对象的历史线索以及与购买对象相似 的作品；对于创作者，其价值在于让创作者了解自己的作品是否与历史上曾出现的作品雷同； 
        对于 NFT 应用，其价值在于为应用提供便捷易用的可能侵权检测能力。Web3.0 Eye 并不准 备成为 NFT 鉴定机构，其定位为 Web3.0 的数据能力服务，为需要不同数据能力的个人以及 机构提供支撑。
      </p>
      <h2>3  技术分析</h2>
      <p>何谓数据能力？聚合、检索、分析、传输即为数据能力。</p>
      <p>
        Web3.0 的进化过程始于区块链，NFT 的发行都依赖于特定公链，不同公链之间不能互通， 导致在不同的公链之间形成数据孤岛。当人们想检索持有的作品，需要在不同公链查询，
        获取该作品在不同公链上的发行情况。这一过程存在几个困难：其一，查询者需要熟悉不同公 链的内容查询方式；其二，查询者需要自己整合查询结果；其三，由于当前区块链查询较为原始，
        查询者需要自己总结作品特征进行文本查询。
      </p>
      <p>对于 NFT 作品的查询以及结果呈现，是否有更加便捷的方式？</p>
      <p>
        自 2009 年 google 搜图上线以来，经历 AI 大爆炸，基于向量检索的以图搜图技术趋于成熟。 NFT 本质上是一个部署在公链上的智能合约，以及存储在链下的媒体内容，链上的智能合约
        储存了媒体内容的存放位置。对于当前的 NFT 而言，该内容大部分为图片，存储在 IPFS 或 中心化的云存储，后将 IPFS 的文件 CID 或中心化存储的 URL 记录在智能合约。NFT 应用从智 能合约获取
        NFT 的存储位置，再通过该位置将 NFT 内容下载后渲染呈现。当前市场上对于 NFT 数据的处理，大体上可分为两种：其一，从智能合约获取 NFT 并呈现，其代表为 OpenSea， 主要关注于 NFT 的展示，
        但缺乏跨链检索能力；其二，以合约 ID 从链上检索 NFT，并将支 持公链的同类 NFT 一起呈现，其代表为 center.dev，主要关注于通过合约 ID 检索已经存在的 NFT，使用方式更倾向于为应用提供 NFT 检索
        但该检索能力不能面向最终用户。我们认为 NFT 作品的检索应该可以有更加简洁的方式，和以图搜图的结合，可以让用户的 NFT 检索过 程便捷而流畅，在检索结果可以更加有效整合不同维度的作品信息
        并可以整合 Web2.0 的 同类数据，提供更加深度的检索结果。
      </p>
      <h3>3.1  聚合</h3>
      <p>
        当今日头条推出算法推荐，将人们隔离在自我认知的信息孤岛，我们会忘记今日头条事实上 是一个信息聚合软件，披着算法推荐和信息流的外衣。今天对于蓬勃出现的各种公链，以及 依附于其上的 NFT 内容，
        我们至少需要一个公链的聚合软件，让人们有更加便捷的方式可 以访问不同生态的 NFT 作品。这样的聚合能力一方面丰富了 NFT 的生态，另一方面使得发 行在不同公链的内容拥有门槛更低的流量入口，
        为创作者带来更多展示机会。
      </p>
      <h3>3.2  分析</h3>
      <p>
        我们之所以将分析列于检索之前，在于我们认为无论是传统互联网，亦或是 Web3.0 内容网 络，内容都已泛滥成灾，我们无需担心这一网络中没有用户需要的内容，随着时间发展，网 络规模以及参与者规模增长，
        内容将会爆炸式增长，我们需要关注的是为合适的人提供合适 的内容。有人关心格调，有人关心价钱，有人为了收藏，有人为了投机，目的不同者各取所 需。今日头条依靠其算法推荐引擎，为用户提供源源不断的领域相关内容，
        但也因此将用户 隔离在自我认知的信息孤岛，甚至增加用户获取不同领域信息的壁垒。Web2.0 的互联网巨 头通过搜集个人行为信息为用户生成标签，以实现不同用户的内容定位。Web3.0 注重用户隐私，
        注重用户数据所有权，我们或许可以从数据出发，为使用者提供基于内容的更有深度 的分析结果。相较于 Web2.0 的数据分析引擎而言，Web3.0 的分析引擎更加关注于挖掘数据自身的价值，
        将更加广泛的更有价值的内容呈现给用户，而非挖掘用户习惯以便于给用户推 送更多相同领域的重复信息。
      </p>
      <h3>3.3  检索</h3>
      <p>
        从最早的图书馆编目，到图书馆管理系统，到门户网站超级链接，到索引全网数据的搜索引 擎，到基于用户行为习惯的千人千面，信息一直以最原始亦最高效的方式组织。
        今天我们从 google 搜索到一张图片，一篇文章，其获取的结果与此前我们到图书馆，查询一本书的位置， 找到该书并获取某一章节的内容并无二致。检索是与信息的产生相伴生的能力，
        但往往在内容增长到相当规模，信息检索才更加重要。于检索而言，其方式总是从最粗暴的信息聚合开 始，逐渐向更加精准的搜索结果演化。我们认为，Web3.0 最终在内容检索上，
        亦需要经历 与其前辈相同的检索方式演进，今天我们甚至不能判断传统的搜索引擎是否是将来 Web3.0 的检索方式，但无可否认的是高效的信息组织方式以及信息检索一定是其不可或缺的能力。
      </p>
      <h3>3.4  传输</h3>
      <p>
        无论是传统互联网的内容提供商，还是基于区块链的内容提供商，都需要将数据从内容提供 方传输到内容客户端，其区别仅在于信源是来自于某中心化组织托管的服务器，还是来自于运行区块链系统的某节点。
        运行于中心化组织托管的服务器依靠内容提供方确保内容在线， 区块链节点则依靠分布于世界各地的节点存储的副本数确保内容安全。中心化服务器可以使 用先进的传输技术如 SDN、QUIC 等网络优化手段进一步提升传输效率，
        优化客户端使用体 验，区块链节点只能依靠点对点传输提供数据，而该点对点传输通常架设于公用网络之上， 其效率依赖于公用网络路由选择的合理性。但区块链节点的点对点传输或许能够在应用层架设更加灵活的多径传输通道，
        这亦是中心化内容传输所不能比拟。总而言之，Web3.0 上的 使用体验，将来亦极大依赖于高效的内容传输能力。我们不能想象，当用户试图获取其 NFT 作品，
        该作品却需要从遥远的美利坚合众国经由 IPFS 的点对点网络拉取到南亚次大陆，该 过程让用户为了一张 3M 的图片等待了 30 秒钟，这在传统互联网是一种怎样灾难的体验。
      </p>
      <p class='caption'>
        除此之外，数据能力还包含经典的存储、分发、缓存、持久化、恢复、安全等能力，但这些能力是所有涉 及数据服务的从业者都需要面对的基础，无论是 Web2.0 的从业者还是 Web3.0 的从业者。
        我们特别列举聚 合、分析、检索、传输几种能力，是特定于基于区块链与分布式存储系统的 Web3.0 场景下，达成良好的应 用体验需要克服的挑战。
      </p>
      <h2>4  产品呈现</h2>
      <p>
        关于 Web3.0 的聚合与检索产品形态，我们在市场上找到的面向终端用户的产品，不外乎于 各公链的浏览器、钱包，以及 NFT 的交易所，这些产品更多偏向于特定于某公链的内容， 
        我们并未找到可以聚合全部公链的产品。检索方面，The Graph 试图构建跨链的 Web3.0 索 引协议，使得第三方开发者可以对不同公链构建检索服务，但 The Graph 并非面向终端用户 的产品；
        center.dev 提供按照合约 ID 检索关联 NFT 的服务，但合约 ID 是使用者已经清楚内 容与公链的关系之后才存在的资料。我们认为，Web3.0 的内容领域也应该存在与 Web2.0 领域相似的内容检索方式，
        无论是基于传统的内容匹配的布尔检索，还是基于特征的向量检 索，其检索方式一定不会局限于使用已知的链上资料检索链上的内容，这样的检索是各公链的浏览器需要完成的任务，
        但不是一个面向用户的检索引擎应该完成的任务。Web3.0 Eye 的产品构思，在于提供最简洁的内容检索方式，用户可以通过分结构化的图片检索结构化的 NFT 数据，
        也可以通过合约 ID，图片特征，作者等结构化数据检索 NFT 结果。从用户层面来 说，用户不需要提前了解特定于 Web3.0 相关的信息，只需要提供其感兴趣的内容，即可检 索与之有关的结果。
      </p>
      <h3>4.1  首页</h3>
      <p>
        Web3.0 Eye 为用户提供简洁的搜索框，用户可以拖拽图片到搜索框执行检索，也可以在搜索 框填写合约 ID、图片特征等关键信息执行检索。除了检索输入，Web3.0 Eye 提供“随便逛 逛”入口，
        该入口将全部公链内容聚合，如果用户并不知道自己需要搜索什么，也可以通过 “随便逛逛”浏览 Web3.0 网络的聚合内容。“随便逛逛”除了作为检索引擎的辅助入口， 也将有独立的入口站点，便于用户收藏访问。
      </p>
      <q-img :src='homepage' />
      <div class='row pic-title'>
        <q-space />
        <p class='label'>图 1</p><p> Web3.0 Eye 首页</p>
        <q-space />
      </div>
      <h3>4.2  检索结果</h3>
      <p>
        Web3.0 Eye 的主要目标之一，在于为用户提供结构化的 NFT 检索结果，以便于用户可以清 楚了解自己所关心的内容在 Web3.0 网络的详细轨迹。当用户输入检索内容，执行检索， 
        Web3.0 Eye 检索引擎执行向量检索与布尔检索结合的混合检索算法，将相应检索结果返回给 客户端展示。客户端将数据按照时间序列排列，并将各相关内容与原始检索内容的相似度关系、
        是否同一作者上传等信息展示给用户。此外，对于检索相关内容的用户，我们预期用户 已经对该内容产生了兴趣，因此，Web3.0 Eye 客户端将组织好的检索目标交易信息一并展示， 
        便于用户了解检索目标的近期交易历史。与首页的“随便逛逛”相似，Web3.0 Eye 客户端亦 将聚合的内容按照一定指标排序，在检索结果页作为快捷访问入口，方便用户访问 Web3.0 网络上出现的新内容或已有内容的新动向。
      </p>
      <q-img :src='searchResult' />
      <div class='row pic-title'>
        <q-space />
        <p class='label'>图 2</p><p> Web3.0 Eye检索结果</p>
        <q-space />
      </div>
      <h2>5  产品架构</h2>
      <q-img :src='productArch' />
      <div class='row pic-title'>
        <q-space />
        <p class='label'>图 3</p><p> Web3.0 Eye产品架构</p>
        <q-space />
      </div>
      <q-img :src='milvusArch' />
      <div class='row pic-title'>
        <q-space />
        <p class='label'>图 4</p><p> Milvus架构</p>
        <q-space />
      </div>
      <p class='caption'>
        Milvus是先进的开源向量检索引擎。我们认为好的产品的出现，一定是基于既有的技术积累，站在巨人的肩膀上实现新的创意。因此，Web3.0 Eye在早期将采用Milvus作为内容检索与存储引擎。
        然而，Web3.0的内容相较于Web2.0内容有其特殊性，例如，传统的检索引擎将认为两只猴子是相似的图片，其结果即所有无聊猿都具有极高相似度；对于像素人头像，传统的检索引擎将认为所有像素人都是同一作品。
      </p>
      <p>
        传统的布尔检索技术发展到一定阶段，网络上非结构化数据逐渐增多，布尔检索技术已经很难高效检索。基于机器学习的向量检索技术将检索目标向量化（Embedding），将物品使用n维属性向量表达，
        为待检索物建立统一空间映射，由此，当用户需要检索某物，只需要将该物件向量化后，针对向量化后的值进行检索，即可从海量数据中快速召回所需结果。当然，对于海量数据的检索并非上述几句话可以简单概括，
        我们在此简要说明向量检索技术，仅为了描述Web3.0 Eye达成目标需要的技术与学术基础。但在Web3.0领域，向量检索技术亦存在其局限性，例如：套装的NFT通常都是相同的图辅以不同特征，
        从而形成独一无二的作品，但在向量检索结果集中，套装的NFT可能会被识别为同一作品。随着Web3.0技术的发展，我们相信普通用户最终亦有能力在Web3.0发表作品，画家可以将自己的画作Mint为独一无二的NFT，
        作家可以将自己的作品上传到IPFS网络，然后将其Token化。因此，一方面我们将基于Milvus持续研发适合当下套装NFT场景的检索方法，另一方面，我们亦将开拓向量检索在将来的Web3.0内容场景的检索应用。
      </p>
      <h2>6  市场分析</h2>
      <p>
        Verified Market Research的NFT市场分析报告显示，2021年全球NFT市场规模大约为113亿美元，预期在2030年前每年将以33.7%的复合增长率持续增长，2030年全球NFT市场规模将达到惊人的2310亿美元。
        来自于Business Wire的NFT市场趋势对于市场的预测与VMR的分析几乎一致，其预测2028年全球NFT市场规模将达到976亿美元，每年增长率大约为31.6%。
      </p>
      <p>
        即使在熊市期间，NFT和Web3.0的链上数据依然保持持续增长。
      </p>
      <p>
        2022年第二季度，Terra的崩盘给加密市场带来巨大冲击，市场陷入恐慌情绪，DeFi与CeFi参与者遭遇流动性紧缩，一些CeFi由于担心客户挤兑造成流动性缺乏暂停提款转账业务。
        此后，三箭资本在Terra崩盘后未能及时追缴大部分保证金陷入清算局面，进一步加剧市场恐慌情绪，加密市场反弹希望落空。3AC在多个项目的种子轮融资资金可能产生涓滴效应，
        可能导致所参与项目的原生协议货币遭受严重的抛压。一系列的黑天鹅事件使得DeFi市场暴跌至2021年的水平。
      </p>
      <p>
        尽管加密市场在2022年第二季度遭受重创，并引领整个市场进入熊市，但NFT的整体需求仍在上升。随着ETH贬值，以美元计的前100个NFT集合市值相较于第一季度下降63%，
        但以ETH计的NFT市值数据一直持续增长。除了OpenSea，市场上新的NFT交易所陆续出现，如 LooksRare、x2y2 和 Solana 的 Magic Eden，Coinbase上线其NFT交易市场，
        传统的电商巨头eBay收购KnownOrigin以扩充其数字商品板块。
      </p>
      <p>
        新兴的Web3.0先行者和传统创新者的持续加入，亦可证明NFT乃至于将NFT作为入口的元宇宙市场的逐渐启航，但早期刨除热钱和市场教育阶段的浮躁，基础设施的建设将会经历较长的时间沉淀，
        逐渐形成较为完善的生态应用场景。
      </p>
      <a href='https://www.businesswire.com/news/home/20220909005420/en/Global-Non-fungible-Token-NFT-Market-TrendsAnalysis-Report-2022---ResearchAndMarkets.com'>
        Global-Non-fungible-Token-NFT-Market-TrendsAnalysis-Report-2022
      </a><br>
      <a href='https://www.forbesindia.com/article/crypto-made-easy/nft-market-worth-231-billion-by-2030-report/78191/1'>
        nft-market-worth-231-billion-by-2030-report
      </a><br>
      <a href='https://www.binance.com/zh-CN/news/top/7146665'>
        https://www.binance.com/zh-CN/news/top/7146665
      </a><br>
      <a href='https://www.prnewswire.com/news-releases/non-fungible-token-nft-market-research-report-by-technavio-predicts-usd-147-24-bn-growth-301588382.html'>
        non-fungible-token-nft-market-research-report-by-technavio-predicts-usd-147-24-bn-growth
      </a><br>
      <a href='https://www.grandviewresearch.com/industry-analysis/non-fungible-token-market-report'>
        non-fungible-token-market-report
      </a><br>
      <h2>7  盈利模型</h2>
      <h3>7.1  订阅</h3>
      <p>
        Web3.0 Eye所具有的内容检索能力与内容组织方式，可以为内容开发者与应用开发者提供侵权依据。Web3.0 Eye并不会作为最终的仲裁机构出现，但Web3.0 Eye将向第三方开发者提供API，
        使得第三方开发者可以快速拥有覆盖全链的内容检索能力。
      </p>
      <h3>7.2  导流</h3>
      <p>
        Web3.0 Eye的检索结果聚合了Web3.0上的不同公链内容，同时整合了与其相关的Web2.0内容。相较于当下Web3.0内容分散于各条公链的形态，Web3.0 Eye能为用户提供更加低门槛的统一入口。
      </p>
      <h3>7.3  推荐</h3>
      <p>
        Web3.0 Eye基于内容的分析引擎，有能力对内容做深度分析，提供基于内容的关联推广，满足用户不同维度的资讯获取需求。
      </p>
      <h2>8  目标区域</h2>
      <p>
        Web3.0 Eye是全球化的Web3.0检索引擎。
      </p>
      <h2>9  竞品分析</h2>
      <h3>9.1  center.dev</h3>
      <p>
        于2022年7月28日完成1100万美元种子轮融资。其依靠waldo创建NFT索引，并提供API以及封装好的组件供应用开发者使用。
      </p>
    </div>
    <div class='table2'>
      <ContentTable :content-table='contentTable' />
    </div>
  </div>
</template>

<script setup lang='ts'>
import { defineAsyncComponent } from 'vue'

import homepage from '../../../assets/meterial/homepage.png'
import searchResult from '../../../assets/meterial/search-result.png'
import productArch from '../../../assets/meterial/product-arch.png'
import milvusArch from '../../../assets/meterial/milvus-arch.png'

const ContentTable = defineAsyncComponent(() => import('../../BlogPage/ContentTable.vue'))

const contentTable = [
  {
    label: 'Web3Eye白皮书',
    header: 'root',
    children: [
      {
        label: '1  内容提要',
        header: 'generic'
      }, {
        label: '2  Web3.0 Eye 是什么',
        header: 'generic'
      }, {
        label: '3  技术分析',
        header: 'generic',
        children: [
          {
            label: '3.1  聚合',
            header: 'generic'
          }, {
            label: '3.2  分析',
            header: 'generic'
          }, {
            label: '3.3  检索',
            header: 'generic'
          }, {
            label: '3.4  传输',
            header: 'generic'
          }
        ]
      }, {
        label: '4  产品呈现',
        header: 'generic',
        children: [
          {
            label: '4.1  首页',
            header: 'generic'
          }, {
            label: '4.2  检索结果',
            header: 'generic'
          }
        ]
      }, {
        label: '5  产品架构',
        header: 'generic'
      }, {
        label: '6  市场分析',
        header: 'generic'
      }, {
        label: '7  盈利模型',
        header: 'generic',
        children: [
          {
            label: '7.1  订阅',
            header: 'generic'
          }, {
            label: '7.2  导流',
            header: 'generic'
          }, {
            label: '7.3  推荐',
            header: 'generic'
          }
        ]
      }, {
        label: '8  目标区域',
        header: 'generic'
      }, {
        label: '9  竞品分析',
        header: 'generic'
      }
    ]
  }
]

</script>

<style scoped lang='sass'>
p
  font-size: 20px
  color: $grey-10

.article
  width: 74%
  margin-right: 5%
  @media (max-width: $breakpoint-sm-min)
    width: 100%
    margin-right: 0

.table1
  display: none
  @media (max-width: $breakpoint-sm-min)
    width: 100%
    display: inline

.table2
  width: 20%
  @media (max-width: $breakpoint-sm-min)
    display: inline

h2
  color: $blue-14

.caption
  font-family: '楷体','楷体_GB2312'

.label
  font-weight: bold
  margin-right: 10px

.pic-title
  margin: 10px
</style>
